---
type: ModelCurveArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ModelCurveArray

`Autodesk.Revit.DB.ModelCurveArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ModelCurveArray | — | `public ModelCurveArray ()` |
| Method | Append | — | `public virtual void Append ( ModelCurve item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ModelCurveArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( ModelCurve item , int index )` |
| Method | ReverseIterator | — | `public virtual ModelCurveArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual ModelCurve this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |